Repository: oprogramador/plezuro_js
Catalog: doc/rst/source/locale/*/LC_MESSAGES/implementation.po
Languages: pl

source: Package engine
pl: Pakiet engine

source: This is the kernel of the compiler. It is not dependent on the output language.
pl: To jądro kompilatora. Jest niezależne od języka wynikowego.

source: Classes:
pl: Klasy:

source: Engine - It handles the arguments of the compiler. For each pair input file - output files it invokes the Parser.
pl: Engine - obsługuje argumenty kompilatora. Dla każdej pary plik źródłowy - plik wynikowy wywołuje Parser.

source: Parser - It reads the input, handles the situation of an empty file, invokes the Tokenizer, it invokes the basic operations for each token and finally it writes to the output.
pl: Parser - czyta wejście, wychwytuje sytuację z pustym plikiem, wywołuje Tokenizer, wywołuje podstawowe operacje na każdym tokenie i ostatecznie zapisuje na wyjście.

source: Tokenizer - It divides the code into tokens by conditions given in token classes.
pl: Tokenizer- dzieli kod na tokeny według warunków danych w klasach tokenów.

source: Validator - It detects all the possible syntax errors.
pl: Validator - wykrywa wszystkie możliwe błędy składniowe.

source: Compiler
pl: Kompilator

source: The whole compiler is currenty implemented in Java.
pl: Cały kompilator jest obecnie zaimplementowany w Javie.

source: It is divided into the following packages:
pl: Jest podzielony na następujące pakiety:

source: mondo.engine - the kernel of the compiler
pl: mondo.engine - jądra kompilatora

source: mondo.invalidToken - the exception classes combined with syntax errors and their binding to the output language
pl: mondo.invalidToken - klasy wyjątków związanych z błędami składniowymi i ich wiązanie z językiem wynikowym

source: mondo.main - the main class and function
pl: mondo.main - główna klasa i funkcja

source: mondo.token - translation of Plezuro specific tokens to the output language
pl: mondo.token - translacja konkretnych tokenów do wynikowego języka

source: mondo.main and mondo.engine are not dependent on the output language, on the other hand mondo.token and mondo.invalidToken are dependent. So if you want to write a compiler from Plezuro to other language than Javascript, you should change only the packages mondo.token and mondo.invalidToken.
pl: mondo.main i mondo.engine są niezależne od języka wynikowego, natomiast mondo.token oraz mondo.invalidToken są zależne. Zatem jeśli chcesz napisać kompilator Plezuro to innego języka niż Javascript, powinieneś zmienić jedynie pakiety mondo.token oraz mondo.invalidToken.

source: Package invalidToken
pl: Pakiet invalidToken

source: This is the set of all the tokens and subtokens of Plezuro with their translation to Javascript.
pl: To zbiór wszystkich tokenów wraz z subtokenami występujących w Plezuro oraz ich translacja do Javascripta.

source: General algorithm
pl: Ogólny algorytm

source: We can specify the main parts of the algorithm:
pl: Możemy określić główne części algorytmu:

source: Compiling
pl: Kompilacja

source: Reading the script.
pl: Wczytanie skryptu.

source: Division of the code into the lines.
pl: Podział kodu na linie.

source: Tokenization:
pl: Tokenizacja:

source: lines are divided into tokens
pl: linie są dzielone na tokeny

source: except of multiline tokens which can expand to multiple lines
pl: z wyjątkiem tokenów wieloliniowych, które mogą się rozciągać na wiele linii

source: Eventual changing of token types (ex. from basic ones to its subtokens).
pl: Ewentualna zmiana typów tokenów (np. z podstawowych do ich subtokenów).

source: Validation - detecting of syntax errors by the tokens order.
pl: Walidacja - wykrycie błędów składniowych, badając kolejność tokenów.

source: Converting of Plezuro tokens into the output language tokens.
pl: Konwersja tokenów Plezuro to tokenów języka wynikowego.

source: Writing output to the file.
pl: Zapis wyjścia do pliku.

source: Implementation
pl: Implementacja

source: This is documentation of the mainstream Plezuro implementation.
pl: To jest dokumentacja implementacji głównej wersji Plezuro.

source: This is for developers who want to write extensions for the language, as well for them who want to write their own implementation (for obtaining the exact knowledge how it works and how to create a compiler in a simple way).
pl: Dla programistów zamierzających pisać rozszerzenia do języka oraz do tych, którzy chcą stworzyć ich własne implementacje (dla otrzymania dokładnej wiedzy jak to działa i jak napisać kompilator w prosty sposób)

source: Main parts
pl: Główne części

source: The source code is divided into the following parts:
pl: Kod źródłowy jest podzielony na następujące części:

source: node_modules - external libraries providing functionalities above the standard Javascript
pl: node_modules - zewnętrzne biblioteki dające funkcjonalności większe niż standardowy Javascript

source: scripts - automated scripts to compiling, running and testing Plezuro
pl: scripts - automatyzujące skrypty do kompilowania, uruchamiania i testowania Plezuro

source: src/java - source code of the compiler in Java:
pl: src/java - kod źródłowy kompilatora w Javie:

source: src/js - Javascript libraries providing Plezuro capabilities for Javascript
pl: src/js - biblioteki Javascript dające możliwości Plezuro do Javascripta

source: Scripts
pl: Skrypty

source: In the 'scripts' directory there are utilities for compilation, running and testing Plezuro.
pl: W folderze 'scripts' są narzędzia do kompilacji, uruchamiania i testowania Plezuro

source: Name
pl: Nazwa

source: Action
pl: Akcja

source: Example
pl: Przykład

source: building Java source code into .class files
pl: kompilowanie kodu Javy do plików .class

source: deleting all generated output files
pl: usuwanie wszystkich wygenerowanych plików

source: joining all Javascript libraries into bin/js/plezuro.js
pl: łączenie wszystkich bibliotek Javascript do bin/js/plezuro.js

source: testing Plezuro scripts
pl: testowanie skryptów Plezuro

source: As you can see, some of these scripts invoke others. So to do all you need, just run three of them:
pl: Jak widzisz, niektóre ze skryptów wywołują inne. Zatem aby zrobić wszystko, czego potrzebujesz, po prostu uruchom trzy z nich:

source: These three are not combined into one at reason of not mixing their outputs.
pl: Te trzy nie są połączone w jeden, aby ich wyjście się nie pomieszało.

source: Tools
pl: Narzędzia

source: The basic tool is the Java 1.8. However in the future it is scheduled a compiler implemented in Plezuro.
pl: Podstawowym narzędziem jest Java 1.8. Aczkolwiek w przyszłości jest zaplanowany kompilator zaimplementowany w Plezuro.

source: To fully utilize the source of Plezuro, you need:
pl: Aby w pełni wykorzystać źródło Plezuro, potrzebujesz:

source: A Unix-like operating system.
pl: Unix-podobny system operacyjny.

source: In not Unix-like systems the Plezuro development is still possible, although you have to rewrite the automating scripts.
pl: W systemach nie-unixowych rozwijanie Plezuro jest nadal możliwe, chociaż trzeba będzie wtedy przepisać skrypty automatyzujące.

source: compiling single script (into 'bin' directory) for plezuro files,
pl: kompilowanie pojedynczego skryptu (do folderu 'bin') dla plików Plezuro,

source: copying for other files,
pl: kopiowanie dla pozostałych plików,

source: recursive running the same script for the directories
pl: rekurencyjne działanie dla folderów

source: exporting .class files into single .jar
pl: eksport plików .class to pojedynczego .jar

source: copying .jar file into '/usr/bin/',
pl: kopiowanie pliku .jar do '/usr/bin'

source: compiling all Plezuro scripts from 'src/plezuro' to 'bin/js'
pl: kompilowanie skryptów Plezuro z 'src/plezuro' do 'bin/js'

source: **For whom is it?**
pl: **Dla kogo to jest?**

source: Binding output language (currenty Javascript) libraries.
pl: Wiązanie bibliotek z języka wynikowego (obecnie Javascript).

source: Package token
pl: Pakiet token

source: This is the set of all exception classes. It includes their mapping to the Javascript. All the other classes inherit from the InvalidTokenException.
pl: To zbiór wszystkich klas wyjątków. Zawiera ich mapowanie do Javascripta. Wszystkie pozostałe klasy dziedziczą po InvalidTokenException.

source: Checking if the script is not empty (otherwise it returns null).
pl: Sprawdzenie czy skrypt nie jest pusty (w przeciwnym razie zwraca null).
