Repository: oprogramador/plezuro_js
Catalog: doc/rst/source/locale/*/LC_MESSAGES/tutorial.po
Languages: pl

source: Using the plezuro.jar (download from https://plezuro.herokuapp.com/downloads/plezuro.jar) executable you can compile a script from Plezuro to Javascript. It works for entire files, not a code embedded in HTML. You can use it within a browser, in the server side (using Node.js), for the mobile development (using Cordova) or any other technology that uses Javascript. Another important thing is to attach the plezuro.js (download from https://plezuro.herokuapp.com/downloads/plezuro.js) library (in HTML for browser and Cordova or using 'require' for Node.js). There is an automated support for all the Javascript libraries because you can use all the global variables from the Javascript. A variable cannot contain the dollar sign in its name in contrary to the Javascript so using jQuery instead of a dollar sign you should use the variable jQuery or eventually ``eval('$')``.
pl: Używając pliku wykonywalnego plezuro.jar (pobierz https://plezuro.herokuapp.com/downloads/plezuro.jar), możesz skompilować skrypt z Plezuro do Javascripta. Działa to dla całych plików, ale nie dla kodu zagnieżdżonego w HTML. Można używać Plezuro w Przeglądarce, po stronie serwera (używając Node.js), w tworzeniu aplikacji mobilnych (używając pakietu Cordova) lub w jakiejkolwiek innej technologii używającej Javascript. Inną ważną sprawą jest dołączenie biblioteki plezuro.js (pobierz z https://plezuro.herokuapp.com/downloads/plezuro.js). Możesz to zrobić w HTML w aplikacji na przeglądarkę lub Cordovie bądź przy użyciu ``require`` w Node.js). Istnieje automatyczne wsparcie dla wszystkich bibliotek Javascriptowych, bo można w Plezuro używać wszystkich zmiennych z Javascript. Zmienna nie może zawierać znaku dolara w jej nazwie w przeciwieństwie do Javascripta, więc aby użyć jQuery, zamiast znaku dolara należy użyć zmiennej jQuery lub ewentualnie ``eval('$')``.

source: One of the important features of a programming language are operators. Technically it would be possible to create a language without operators. However it facilities much the syntax. For example in an expression ``1+3`` we have an operator ``+`` which does the addition. In comparison with other languages, Plezuro has some special operators such as the comma (',') or the semicolon (';').
pl: Jedną z ważnych możliwości języka programowania jest użycie operatorów. Technicznie byłoby możliwe stworzyć język bez operatorów. Jednak uproszczają one bardzo składnię. Na przykład w wyrażeniu ``1+3`` mamy operator ``+``, który wykonuje dodawanie. W porównaniu z innymi językami, Plezuro posiada pewne specjalne operatory takie jak przecinek ``,`` czy średnik ``;``.

source: The action of an operator depends of the type of the zero argument. It behaves in the same way like the method call. It is possible to change the operators action in the runtime (even you can cause that 2+2 produce another result than 4 so it is not recommended to change it in abundance).
pl: Akcja operatora zależy od typu zerowego argumentu. Działanie jest identyczne jak w przypadku wywołania metody. Jest możliwe zmienić akcję operatorów w trakcie wykonywania programu (możesz nawet spowodować, że wyrażenie `2+2` zwróci wynik inny niż 4, więc nie jest zalecane używać tego nadmiernie)

source: double-argument operators (the zero argument, the operator, the first argument; from the evaluated at the end to the evaluated at the begin)
pl: dwuargumentowe operatory (zerowy argument, operator, pierwszy argument)

source: The scope of a variable is limited within the curlies ('{', '}') which are used for the function (even a conditional or a loop used an inner function). So if you want to use a variable across multiple functions, you have to declare it a propriate place.
pl: Zasięg zmiennej jest ograniczony w obrębie klamer (``{``, ``}``), które to są używane do tworzenie funkcji (nawet instrukcja warunkowa czy pętla to wewnętrzna funkcja). Zatem jeśli chcesz używać zmiennej w obrębie wielu funkcji, musisz zadeklarować ją w odpowiednim miejscu.

source: Technically it would be possible to create an object without constructor. You could initialize all the fields with one or multiple methods (using the builder pattern). Eventually after that you could freeze the entire object or some of its fields.
pl: Technicznie byłoby możliwe stworzyć obiekt bez konstruktora. Możesz zainicjalizować wszystkie pola jedną lub wieloma metodami (używając wzorca builder). Ewentualnie po tym można by zamrozić cały obiekt lub tylko niektóre z jego pól.

source: One of useful features is the possibility of the calling a parent method. The syntax is similar to the Python because in the case of multiple inheritance, you have to specify from which parent you want to call a method. It is also possible to call a method from a super-parent and even from any other class because of duck typing. You write a parent module name, the double colon ('::'), the method name and the 'this' keyword like the zero argument.
pl: Ważną sprawą jest możliwość wywołania metody rodzica. Składnie jest podobna do tej w Pythonie, ponieważ z powodu wielokrotnego dziedziczenia, trzeba określić, z którego rodzica metoda ma być wywołana. Jest również możliwe wywołać metodę z dalszego przodka a nawet z jakiegokolwiek innego moduły z powodu duck typing. Składnia jest następująca: najpierw nazwa modułu, następnie podwójny dwukropek `::`, nazwa metody oraz słowo ``this`` jako zerowy argument.

source: You can change the CSS style. You can use the CSS name with a hyphen ``-`` as well the camelcase. For example ``element['style']['backgroundColor'] = 'red'``
pl: Możesz zmienić styl CSS. Można użyć nazwy CSS z myślnikiem ``-`` jak również camelcase. Np. ``element['style']['backgroundColor'] = 'red'``

source: It fires when a key is being pressed (even multiple times).
pl: Jest wywoływany kiedy klawisz jest wciśnięty (nawet wiele razy).

source: It stands for HTML Document Object Model. It represents a tree of objects.
pl: Ten skrót oznaczy Document Object Model (dokumentowy-obiektowy model). Przedstawia drzewo obiektów.

source: Currently the main version of the Plezuro is compiled to Javascript. In the future it is planned to compile it to another languages (probably c, c♯, Java, Python, Ruby and PHP, eventually Lisp and Fortran). It exists also an interpreted version implemented in c♯ which is not supported anymore. That version is not compatible in 100% with the mainstream Plezuro. It is something like a prototype of the final product.
pl: Obecnie główna wersja Plezuro jest kompilowana do Javascripta. W przyszłości jest planowane kompilowanie do innych języków (prawdopodobnie C, C♯, Java, Python, Ruby i PHP, eventualnie Lisp i Fortran). Istnieje również wersja interpretowana zaimplementowana w C♯, która jednak nie jest dłużej rozwijana. Tamta wersja nie jest w pełni zgodna w główną wersją Plezuro. To coś na kształt prototypu końcowego produktu.

source: Useful materials
pl: Przydatne materiały

source: Official website:
pl: Oficjalna strona internetowa:

source: The most basic one is the list. To create a list, you use square brackets ('[', ']'), the elements are separated by a comma (','). It can contain objects of different types (like list in Python, Ruby, Javascript or PHP as well List<Object> in Java or List<object> in c♯). It implies that a list can also contain other lists. Moreover a list can contain a self-reference (it means one of its elements is a pointer to this list) because the lists are passed by reference to functions and to collections.
pl: Podstawową z nich jest lista. Aby ją stworzyć, powinieneś użyć nawiasów kwadratowych ('[', ']') oraz elementów oddzielonych przecinkiem (','). Lista może zawierać obiekty różnych typów (tak jak lista w Pythonie, Ruby, Javascripcie, PHP jak również List<Object> w Javie czy List<object> w C♯). Z tego wynika że lista może zawierać nawet inne listy. Ponadto lista może mieścić w sobie samo-referencję (to znaczy że jeden z jej elementów jest wskaźnikiem na nią samą) ponieważ listy są przekazywane przez referencję to funkcji oraz kolekcji.

source: Basically it is a set of pairs key-value. It is like dictionary in Python, hash in Ruby, Dictionary<object, object> in c♯ or Map<Object, Object> in Java. However there is a notably difference between the Plezuro dictionary and associative array in PHP or object in Javascript because in the dictionary the order of the items does not matter and generally it is stored using a binary tree. You write it with a hash sign ('#') and brackets.
pl: W prostym ujęcie to zbiór par klucz-wartość. To tak jak dictionary Pythonie, hash w Ruby, Dictionary<object, object> w C♯ czy Map<Object, Object> w Javie. Jednakże istnieje istotna różnica pomiędzy słownikiem Plezuro a tablicą asocjacyjną w PHP czy obiektem w Javascripcie gdyż w słowniku nie ma znaczenia kolejność elementów i ogólnie jest przechowywany na drzewie binarnym. Możesz zapisać słownik przy użyciu krzyżyka ('#') oraz nawiasów.

source: The comments are like in c++, Java, and c♯. You can comment one line using '//' or multiple lines using '/\*' and '\*/'.
pl: Komentarze wyglądają tak jak w C++, Javie czy C♯. Możesz zakomentować jedną linię, używając '//' lub wiele linii przy użyciu '/\*' oraz '\*/.

source: In the Plezuro like in the majority of the programming languages a variable name can begin with a letter or an underscore ('_') and the next characters of the name can be a letter, an underscore or a digit. The case of the characters matters (like in c, Java, Python and so on, differently from SQL and HTML). You can use only the ASCII letters. It is for the readability (it would be extremely strange if someone used Arabic, Chinese characters or some mix of them). The recommended style of the naming all the variables (including functions and modules) is the camelcase (ex. ```aVeryInterestingVariable```).
pl: W Plezuro tak jak w większości języków nazwa zmiennej może zaczynać się literą lub podkreśleniem ``_`` a następne znaki to litera, podkreślenie lub cyfra. Wielkość liter nie ma znaczenia (tak jak w C, Javie, Pythonie i tak dalej, przeciwnie do SQL i HTML). Można używać jedynie znaków ASCII. Jest tak dla czytelności kodu (byłoby zupełnie dziwne jeśli ktoś użyłby liter arabskich, chińskich czy jakiejś mieszaniny tego i tego). Zalecany styl nazywania zmiennych (w tym funkcji i modułów) to camelcase (np. ``aVeryInterestingVariable``).

source: If you are a programmer who just knows another programming language (ex. c, Java, Python...), this tutorial bring you the knowledge necessary to create applications in Plezuro. Nonetheless the experience is what is the most important in programming technologies. So just try to write more and more in Plezuro.
pl: Jeśli jesteś programistą, który zna już inny język programowania (np. C, Java, Python...), ten przewodnik przyniesie ci wiedzę potrzebną do tworzenia aplikacji w Plezuro. Jednakże w technologiach programistycznych to doświadczenie jest najważniejsze. Zatem po prostu próbuj pisać jak najwięcej w Plezuro.

source: To write an object-oriented code except of classes (in Plezuro modules) it is needed to use inheritance and polymorphism. In Plezuro there is multiple inheritance like in Python, it is also similar to multiple inheritance in c++ with virtual method binding. Why multiple inheritance? It is just more similar to the real life. For example, the dog is in the same time a pet and a carnivore.
pl: Żeby pisać kod obiektowy poza klasami (w przypadku Plezuro modułami) jest niezbędne użycie dziedziczenia i polimorfizmu. W Plezuro występuje wielokrotne dziedziczenie tak jak w Pythonie, jest także nieco podobne do wielokrotnego dziedziczenia w C++ przy użyciu wirtualnego wiązania metod. Dlaczego wielokrotne dziedziczenie? To po prostu bardziej zbliżone do prawdziwego życie. Np. pies jest w tym samym czasie zwierzęciem domowym i drapieżnikiem

source: On Github:
pl: Na Githubie
