Repository: oprogramador/plezuro_js
Catalog: doc/rst/source/locale/*/LC_MESSAGES/tutorial.po
Languages: pl

source: Except of using a module like a template to creating objects, you can use it in a static way with static fields and methods. You have to remember that the static fields and methods are not inherited. Each static field or method is binded strictly with one module.
pl: Poza użyciem modułu jako szablon do tworzenia obiektów, możesz użyć go w statyczny sposób za pomocą pól i metod statycznych. Powinieneś pamiętać, że statyczne pola i metody nie są dziedziczone. Każde pole statyczne i każda metoda statyczna są związane dokładnie z jednym modułem.

source: Generally we can specify some main actions of the operators (ex. for numbers and strings).
pl: Ogólnie możemy wyróżnić pewne główne akcje operatorów (np. dla liczb i stringów).

source: Type of left argument
pl: Typ lewego argumentu

source: Action
pl: Akcja

source: Example
pl: Przykład

source: Result
pl: Wynik

source: Number
pl: Liczba

source: addition
pl: dodawanie

source: subtraction
pl: odejmowanie

source: multiplication
pl: mnożenie

source: division
pl: dzielenie

source: power
pl: potęga

source: modulo
pl: reszta z dzielenia

source: concatenation
pl: konkatenacja

source: Contrary to Javascript, Plezuro cannot be embedded to HTML. It is not a missing feature, rather a way to maintain a readable code. So you must include a Javascript generated from Plezuro source in an HTML file. Moreover you must include the plezuro.js library.
pl: Przeciwnie do Javascripta, Plezuro nie może być zagnieżdżony w kodzie HTML. To nie brakująca możliwość ale raczej sposób na utrzymaniu czytelnego kodu. Zatem trzeba dołączyć w pliku HTML Javascript wygenerowany ze źródła w Plezuro. Ponadto należy dołączyć bibliotekę plezuro.js.

source: Web browser programming
pl: Programowanie na przeglądarkę internetową

source: As you just know, Plezuro is compiled to Javascript. So we can write applications runned in the web browser (client-side web apps).
pl: Jak już wiesz, Plezuro jest kompilowany do Javascripta. W związku z tym możemy pisać aplikacje wykonywane w przeglądarce internetowe (aplikacje webowe wykonywane po stronie klienta).

source: What should you know first?
pl: Co należy znać najpierw?

source: To be able to develop web apps in Plezuro, you should know HTML and CSS (at least the basics). You can read it from the following tutorials:
pl: Aby móc tworzyć aplikacje webowe w Plezuro, powinieneś znać HTML i CSS (przynajmniej podstawy). Możesz się nauczyć tego z następujących przewodników:

source: Output
pl: Wyjście

source: This is tutorial of Plezuro programming language.
pl: To jest przewodnik po języku programowania Plezuro

source: For whom is it?
pl: **Dla kogo to jest?**

source: If you are new to programming, this tutorial should be readable for you because it explaines how the stuff works but if you do not understand it maybe you should learn first basics of Javascript (it is the most related to Plezuro) or eventually another programming language.
pl: Jeśli programowanie jest czymś nowym dla ciebie, ten poradnik powinien być zrozumiały dla ciebie, ponieważ wyjaśnia on, jak wszystko działa. Jeśli jednak nie rozumiesz tego, być może najpierw powinieneś najpierw nauczyć się podstaw Javascripta (ten język jest najbardziej zbliżony do Plezuro) lub ewentualnie nauczyć się jeszcze innego języka programowania

source: Other useful materials
pl: **Inne przydatne matetiały**

source: If you want to learn more, you can read the specification of Plezuro. It is written in a not complicated manner. This is just a view from another site. You can read Plezuro scripts on Github and try to write something similar.
pl: Jeśli chcesz, nauczyć się więcej, powinieneś przeczytać specyfikację Plezuro. Jest ona napisana w niezbyt skomplikowany sposób. To po prostu spojrzenie z innej strony. Możesz przeglądać skrypty Plezuro na Githubie i próbować napisać coś podobnego.

source: Basic usage of the compiler: ``plezuro.jar input.plez output.plez.js``
pl: Podstawowe użycie kompilatora: ``plezuro.jar input.plez output.plez.js``

source: AJAX stands for Asynchronous Javascript and XML. It is a set of web development techniques to create asynchronous web applications. Nonetheless XML is not necessary in AJAX, it can be any sort of data (JSON, CSV, HTML, CSS, images, Javascript). AJAX is almost always associated with a serwer-side programming (a server response dependent on the request). Technically it is always true because you send a request and a server in regard to it returns a response. However not always a script in a language such as PHP, Python or Ruby is needed. Server can also return some static data (ex. images) according to their path. The best example is the Apache 2 server.
pl: AJAX to skrót od Asynchronous Javascript and XML (Asynchroniczny Javascript i XML). Jest to zbiór praktyk programistycznych do tworzenia asynchronicznych aplikacji webowych. Chociaż sama nazwa mówi o XML, może być użyty jakikolwiek rodzaj danych (JSON, CSV, HTML, CSS, obrazki, Javascript). AJAX jest prawie zawsze powiązany z programowanie po stronie serwera (odpowiedź serwera zależna od żądania). Technicznie to zawsze prawda, bo wysyłasz żądanie a serwer w zależności od niego zwraca odpowiedź. Tymczasem nie zawsze się to wiąże ze skryptem w języku takim jak PHP, Python czy Ruby. Jest tak ponieważ serwer może też zwrócić statyczne dane (np. obrazki) w zależności od ścieżki. Najlepszym przykładem jest serwer Apache 2.

source: From a client-side developper point of view it enables the communication with the server without page reloading. For example you would like to store some date on the server for security reasons, check if a data provided by the user matches that on the server or download some content dynamically (HTML, CSS, images, other Javascripts) that would be enormous if downloaded fully.
pl: Z punktu widzenia programisty front-end, AJAX umożliwia komunikację z serwerem bez przeładowania strony. Np. chciałbyś przechować jakieś dane na serwerze z powodów bezpieczeństwa, sprawdzić czy dane wprowadzone przez użytkownika pasują do tych na serwerze czy też ściągnąć jakieś zasoby dynamicznie (HTML, CSS, obrazki, inne Javascripty), w przypadku których byłyby wielkie rozmiary jeśli pobierałoby się je w całości.

source: Probably the best way to make an AJAX request is using jQuery at reasons of browser compatibility and code readability.
pl: Prawdopodobnie najlepszy sposób do wysłania zapytania AJAX jest użycie jQuery z powodów kompatybilności między przeglądarkami i czytelności kodu.

source: AngularJS is a framework used mostly in single-page applications. It is a part of MEAN software stack:
pl: AngularJS to framework używane głównie w aplikacjach na jedną podstronę (single page application). Stanowi on część pakietu MEAN:

source: MongoDB - a database
pl: MongoDB - baza danych

source: Express.js - a back-end framework
pl: Express.js - framework back-end

source: AngularJS - a front-end framework
pl: AngularJS - framework front-end

source: Node.js - a back-end platform
pl: Node.js - platforma back-end

source: All of these four technologies are based on Javascript so they are enable to develop in Plezuro.
pl: Wszystkie spośród tychże czterech technologii są oparte na Javascripcie, więc można je używać w Plezuro.

source: The examples below have origin from https://angularjs.org/ and later were adapted to Plezuro.
pl: Przykłady poniżej zostały wzięte z https://angularjs.org/, a następnie zaadoptowane do Plezuro.

source: HTML DOM methods and events
pl: Metody i zdarzenia HTML DOM

source: After previous chapters you are able to create any HTML document statically with ``doument.write``. But probably you wonder to create an interactive app. For example after button pressing an input will change his value.
pl: Po pierwszych podrozdziałach, jesteś w stanie stworzyć statycznie dokument HTML przy użyciu ``document.write``. Jednak prawdopodobnie chciałbyś stworzyć interaktywną aplikację. Np. po kliknięciu na przycisk input zmieni swoją wartość.

source: How to get an element?
pl: Jak dostać element?

source: You can use the standard Javascript methods in Plezuro. Eventually you can use some methods from external libraries such like jQuery.
pl: Możesz użyć standardowych metod Javascript w Plezuro. Ewentualnie da się użyć metod z zewnętrznych bibliotek takich jak jQuery.

source: It returns the element with matching 'id' attribute. Remember if you include your script in the HEAD section, the elements are not loaded so you cannot immediately get any element, in this case you should use the proper event.
pl: Zwraca element z pasującym atrybutem 'id'.

source: It returns the collection of all the elements of the tag name specified as the first argument. For example ``document.getElementsByTagName('div')`` will return the collection of all divs in the document.
pl: Zwraca kolekcję wszystkich elementów z nazwą tagu określoną jako pierwszy parametr. Np. ``document.getElementsByTagName('div')`` zwróci kolekcję wszystkich divów w dokumencie.

source: The collection of all the elements with the value of 'name' attribute specified as the first argument.
pl: Kolekcja wszystkich elementów z wartością atrybutu 'name' określoną jako pierwszy argument.

source: The collection of all the elements with the value of 'class' attribute specified as the first argument.
pl: Kolekcja wszystkich elementów z wartością atrybutu 'class' określoną jako pierwszy argument.

source: Similar to getElementsByTagName but the first argument specifies the name of the namespace and the second one the tag name. It is used rather in XML DOM.
pl: Podobnie do getElementsByTagName ale pierwszy argument określa nazwę przestrzeni nazw a drugi nazwę tagu. Jest to bardziej używane w XML DOM.

source: It returns the first element that matches the CSS selector in the first argument. For example ``document.querySelector('table button')`` will return the first button in the first table that contain a button.
pl: Zwraca pierwszy element, do którego pasuje selektor CSS w pierwszym argumencie. Np. ``document.querySelector('table button')`` zwróci pierwszy przycisk (button) w pierwszej tabeli, która zawiera jakikolwiek przycisk.

source: It return the collection of all the elements that match the given CSS selector.
pl: Zwraca kolekcję wszystkich elementów, dla których pasuje podany selektor CSS.

source: How to operate on elements?
pl: Jak działać na elementach?

source: It is the simplest way to change the content of an element, it just inserts any HTML into the element. For example ``element['innerHTML'] = '<button>OK</button>'``.
pl: To najprostszy sposób, aby zmienić zawartość elementu. Po prostu wstawia jakikolwiek HTML do wnętrza elementu. Np. ``element['innerHTML'] = '<button>OK</button>'``.

source: For example ``element.setAttribute('name', 'age')``
pl: Np. ``element.setAttribute('name', 'wiek')``

source: **style**
pl: **styl**

source: You can create an element. The first argument specifies the tag name. For example, to create a div, you write ``document.createElement('div')``.
pl: Możesz stworzyć element. Pierwszy argument określa nazwę tagu. Np. aby stworzyć div, należy napisać ``document.createElement('div')``.

source: When you have just created an element you can add it to another element either existing in the HTML DOM or not.
pl: Skoro już stworzyłeś element, możesz dodać go do innego elementu za równo istniejącego w HTML DOM lub nie.

source: You can remove an element specified as the first argument.
pl: Możesz usunąć element przekazany jako pierwszy argument.

source: You can replace an element passed as the first argument to an element passed as the second argument.
pl: Możesz zastąpić element przekazany jako pierwszy argument na element przekazany jako drugi argument.

source: You can create a text node with the value specified as the first argument and then append such a node to an element.
pl: Możesz stworzyć węzeł tekstowy z wartością określoną jako pierwszy argument a następnie dodać taki węzeł do elementu.

source: How to listen to en event?
pl: Jak nasłuchiwać zdarzenia?

source: To provide some interaction it is useful to listen to the events. We can detect among others: a mouse click, a key pressing, a document being loaded, a document mutation, an object mutation, browser window resizing.
pl: Aby zapewnić interakcję, przydatne jest nasłuchiwane zdarzeń. Możemy wykryć m.in.: kliknięcie myszą, wciśnięcie klawisza, załadowanie dokumentu, zmianę dokumentu, zmianę obiektu, zmianę rozmiaru okna przeglądarki.

source: You can see the full list of events for Firefox on https://developer.mozilla.org/en-US/docs/Web/Events, or for any browser on http://www.w3schools.com/tags/ref_eventattributes.asp.
pl: Możesz zobaczyć pełną listę zdarzeń dla Firefox na https://developer.mozilla.org/en-US/docs/Web/Events, a dla dowolnej przeglądarki na http://www.w3schools.com/tags/ref_eventattributes.asp.

source: Let us enumerate the most important ones.
pl: Wymieńmy najważniejsze z nich.

source: It fires after the mouse click (pressing and releasing the mouse button). For example ``element['onclick'] = { this['parentNode'].removeChild(this); null }``
pl: Jest wywoływany po kliknięciu myszą (wciśnięcie i puszczenie przycisku myszy).Np. ``element['onclick'] = { this['parentNode'].removeChild(this); null }``

source: It fires after a key being pressed.
pl: Jest wywoływany po wciśnięciu klawisza.

source: It fires after a key being released.
pl: Jest wywoływany po puszczeniu klawisza.

source: HTML elements
pl: elementy HTML

source: In HTML programming (not each web browsing programming is HTML programming because you can use eventually Java applets, Adobe Flash or Silverlight which are deprecated technologies) almost all you see in the browser are the HTML elements. The exceptions include alerts and different sorts of info from browser.
pl: W programowaniu HTML (nie każde programowanie na przeglądarkę internetową to programowanie HTML ponieważ istnieją takie technologie jak aplety Java, Adobe Flash czy Silverlight, jednakże są one przestarzałe) prawie wszystko, co widzisz w przeglądarce to elementy HTML. Wyjątkami są alerty i różne rodzaje powiadomień z przeglądarki.

source: This is a powerful tool. In the desktop application development in most of frameworks you cannot use such tool and it makes the front-end development really harder.
pl: To potężne narzędzie. W programowaniu aplikacji desktopowych w większości frameworków nie ma takiego narzędzie i to czyni programowanie GUI znacznie trudniejszym.

source: **What is an HTML element?**
pl: **Czym jest element HTML?**

source: It can an atomic part of the view you see in the browser (ex. an input, a button, a span), as well something you cannot see (because it is hidden, it has the 0 size or it contains no text) or a tree of other elements.
pl: Może być najmniejszą niepodzielną częścią widoku, który widzisz w przeglądarce (np. input, button, span), jak również tym, czego nie możesz zobaczyć (ponieważ jest ukryty, ma rozmiar 0 lub nie zawiera żadnego tekstu) albo ewentualnie drzewem innych elementów.

source: **What is a tree?**
pl: **Czym jest drzewo?**

source: We can imagine an object tree like a real tree. Each element (node) is a place where one branch is divided to multiple branches (in a special case still one), a leaf (where the tree ends) or the begin of the tree (where it grows out of the ground).
pl: Możemy sobie wyobrazić drzewo obiektów na kształt prawdziwego drzewa. Każdy element (węzeł) to miejsce gdzie jedna gałąź rozdziela się na wiele gałęzi (w szczególnym przypadku nadal jedno), liść (gdzie drzewo się kończy) lub początek drzewa (gdzie wyrasta z ziemi).

source: **Relations in a tree**
pl: **Relacje w drzewie**

source: One element for another can be:
pl: Jeden element dla innego może być:

source: child (in special case the first child)
pl: dzieckiem - child (w szczególnym przypadku pierwszym dzieckiem - first child)

source: parent
pl: rodzicem - parent

source: sibling (in special case the next sibling)
pl: rodzeństwem - sibling (w szczególnym przypadku następnym rodzeństwem - next sibling)

source: ancestor
pl: przodkiem a- ancestor

source: offspring
pl: potomkiem - offspring

source: none of the above
pl: niczym z powyższych

source: Let us notice a child is also an offspring, as well a parent is an ancestor.
pl: Zauważmy, że dziecko jest jednocześnie potomkiem, jak również rodzic jest jednocześnie przodkiem.

source: If you just know same basics of HTML, you should know the outer element is HTML. In reality there is a child of the document which is the most outer element in the whole HTML DOM.
pl: Skoro już znasz podstawy HTML, powinieneś wiedzieć, że zewnętrznym elementem jest HTML. Tak na prawdę to dziecko elementu document, który to jest najbardziej zewnętrznym elementem w całym HTML DOM.

source: **Why is it so important?**
pl: **Dlaczego jest to tak ważne?**

source: Knowing an element, you can operate on his children, siblings, parent. You can replace the children order, copy a subtree and so on.
pl: Znając element, możesz operować na jego dzieciach, rodzeństwie, rodzicu. Możesz zmieniać kolejność dzieci, kopiować poddrzewo i tak dalej.

source: **What Plezuro can do?**
pl: **Co Plezuro może zrobić?**

source: change HTML elements (ex. the text)
pl: zmieniać elementy HTML (np. tekst)

source: add HTML elements
pl: dodawać elementy HTML

source: remove HTML elements
pl: usuwać elementy HTML

source: clone HTML elements
pl: klonować elementy HTML

source: change HTML attributes
pl: zmieniać atrybuty HTML

source: add HTML attributes
pl: dodawać atrybuty HTML

source: remove HTML attributes
pl: usuwać atrybuty HTML

source: change CSS styles
pl: zmieniać style CSS

source: create new HTML events
pl: tworzyć nowe zdarzenia HTML

source: It implies some additional features. For example cloning, removing and adding an element, you can move it.
pl: Z tego wynikają dodatkowe możliwości. Np. klonując, usuwając i dodając element, możesz zmieniać jego położenie.

source: jQuery is a powerful Javascript library which gives you all the browser features that are not included in the pure Javascript and which makes the code shorter and more readable.
pl: jQuery to potężna biblioteka Javascript, która daje ci wszystkie możliwości działanie w przeglądarce, których brakuje w czystym Javascript i która czyni kod krótszym i bardziej czytelnym.

source: The main features:
pl: Główne możliwości to:

source: DOM element selection
pl: selekcja elementów HTML

source: DOM manipulation
pl: manipulacja DOM

source: events
pl: zdarzenia

source: control of the asynchronous processing
pl: kontrola przetwarzania asynchronicznego

source: extensibility
pl: rozszerzalność

source: multi-browser support
pl: wsparcie w wielu przeglądarkach

source: Theoretically jQuery works in the same way in all the browsers. In reality some differences are possible, for example the selector uses the document.querySelectorAll which behaves a little bit differently depending on the browser.
pl: Teoretycznie jQUery działa w taki sam sposób we wszystkich przeglądarkach. W rzeczywistości mogą się zdarzyć pewne różnice, np. selektor używa document.querySelectorAll który zachowuje się nieco różnie w zależności od przeglądarki.

source: To use this library in Plezuro, be aware of:
pl: Aby używać tę bibliotekę, powinieneś być świadomy:

source: The most common use in Javascript is based on the ``$`` variable. In Plezuro it breaks the rules of the variable naming so you can access to the jQuery with the ``jQuery`` variable or eventually using ``eval('$')``.
pl: Najpopularniejsze użycie w Javascript jest oparte na zmiennej ``$``. W Plezuro jest to sprzeczne z zasadami nazewnictwa zmiennych, zatem aby uzyskać dostęp do jQuery, powinieneś użyć zmiennej ``jQuery`` lub ewentualnie ``eval('$')``.

source: You must pass the proper variable as the first argument of ``jQuery`` function, not as the zero argument.
pl: Musisz przekazać odpowiednią zmienną jako pierwszy argument funkcji jQuery, a nie jako zerowy argument.

source: In Plezuro everything is an object but jQuery selector must be a true Javascript string, so you must invoke the ``toString`` method.
pl: W Plezuro wszystko jest obiektem a selektor jQuery musi być prawdziwym stringiem z Javascripta, zatem musisz wywołać metodę ``toString``.

source: Fortunately, there is a simpler way to call jQuery in Plezuro using a special binding. Then you use the ``_jQ`` function and the code looks in the following way:
pl: Na szczęście, istnieje prostszy sposób na wywołanie jQuery w Plezuro przy użyciu specjalnego połączenia. Wystarczy użyć funkcji ``_jQ`` i wtedy kod wygląda w następujący sposób:

source: You can use the standard Javascript ways to output:
pl: Można używać standardowych sposobów Javascripta do wyświetlania na wyjściu:

source: printing into an alert box, using ``window.alert()``
pl: zapis do alertu, używając ``window.alert()``

source: printing into the HTML output using ``document.write()``
pl: zapis do wyjście HTML, używając ``document.write()``

source: printing into an HTML element, using ``element.innerHTML=``
pl: zapis do elementu HTML, używając ``element.innerHTML=``

source: printing into the browser console, using ``console.log()``
pl: zapis do konsoli przeglądarki, używając ``console.log()``

source: However the recommended is the Plezuro way using ``dumpl`` method.
pl: Jednak zalecanym sposobem w Plezuro jest użycie metody ``dumpl``.

source: It looks like Javascript but be aware ex. ``alert()`` without ``window`` will not work unless you pass the ``window`` variable as the zero argument. This is because the zero argument in Plezuro is treated like this object.
pl: Wygląda to jak Javascript, ale wiedz, że ``alert`` bez ``window`` nie zadziała dopóki nie przekaże mu się zmiennej ``window`` jako zerowy argument. Jest tak ponieważ zerowy argument w Plezuro jest traktowany jako dany obiekt.

source: Storage
pl: Pamięć

source: In programming almost all the time you need to store some data. Part of it is more durable and other part less.
pl: W programowaniu prawie cały czas potrzeba zapisywać jakieś dane. Część nich jest bardziej trwała a inna część mniej.

source: In web browser programming you can use the following types of storage:
pl: W programowaniu na przeglądarkę internetową, dostępne są następujące rodzaje pamięci:

source: Durable unless the page is reloaded or closed:
pl: Trwałe dopóki strona jest przeładowana lub zamknięta:

source: Javascript memory
pl: pamięć Javascript

source: More durable:
pl: Bardziej trwałe

source: Naturally, in Plezuro you have the full access to all of them. Moreover there is easy memory sharing between Plezuro and Javascript with global variables or object fields (public as well private).
pl: Naturalnie, w Plezuro jest pełny dostęp do wszystkich tych rodzajów. Ponadto jest wymiana pamięci pomiędzy Plezuro a Javascript poprzez zmienne globalne lub pola obiektu (publiczne jak równie prywatne).
