Repository: oprogramador/plezuro_js
Catalog: doc/rst/source/locale/*/LC_MESSAGES/tutorial.po
Languages: pl

source: How to
pl: Co i jak

source: About Plezuro
pl: O Plezuro

source: Origin
pl: Pochodzenie

source: Where does Plezuro come from? Basically its author was not fully satisfied with any existing programming language. So he thought about the inventing of a new one. The name comes from the Esperanto and means 'pleasure'.
pl: Skąd się wzięło Plezuro? Otóż jego autor nie był w pełni usatysfakcjonowany żadnym z dotychczas istniejących języków programowania. Zatem pomyślał o stworzeniu nowego. Nazwa pochodzi z Esperanto i znaczy 'przyjemność'.

source: Basic rules
pl: Podstawowe zasady

source: Plezuro is an imperative, object-oriented, functional, procedural and reflective programming language.
pl: Plezuro to imperatywny, obiektowy, funkcyjny, proceduralny i refleksyjny język programowania

source: The main ideas are:
pl: Główna założenia to:

source: The code should be possibly short (as long as it is human readable).
pl: Kod powinien być możliwie krótki.

source: Very simple syntax.
pl: Bardzo prosta składnia.

source: The code should be easy to read for a beginner programmer.
pl: Kod powinien być łatwy do przeczytania dla początkującego programisty.

source: The power of the language should be based on the standard library, not its syntax.
pl: Potęga języka powinna być oparta na standardowej bibliotece, a nie na jego składni.

source: Explicit is always better than implicit.
pl: Jawne jest zawsze lepsze niż domniemane.

source: Everything is a variable.
pl: Wszystko jest zmienną.

source: Everything is an object.
pl: Wszystko jest obiektem.

source: Multiple inheritance.
pl: Wielokrotne dziedziczenie.

source: There is no difference between a module, a class and a namespace.
pl: Nie ma różnicy pomiędzy modułem, klasą i przestrzenią nazw.

source: No annotations and other additional syntax - everything is based on the basic syntax of the language.
pl: Brak adnotacji i innych dodatkowych składni - wszystko jest oparte na podstawowej składki języka.

source: Built-in methods
pl: Wbudowane metody

source: In further reading you will take some knowledge of modules and methods in Plezuro. However at this moment you should know how the method works. Basically it is like a function calling. Zero argument (called this object) is accessible via the keyword 'this'. Like in the function you can also use such keywords 'first', 'second', 'third', 'args'. Calling a method, at the first you write the zero argument (this object), than the dot ('.'), function name, bracket opening ('('), arguments separated by the comma (',') and the bracket closing (')'). However with no arguments the bracket is not required.
pl: W dalszych miejscach poradnika zdobędziesz pewną wiedzę o modułach i metodach w Plezuro. Jednak już w tym momencie powinieneś wiedzieć jak działają metody. Prosto mówiąc, to jest jak wywołanie funkcji. Zerowy argument (zwany this - tym obiektem) jest dostępny poprzez słowo kluczowe 'this'. Tak jak w przypadku funkcji, możesz używać słów kluczowych takich jak 'first', 'second', 'third', 'args'. Wywołując metodę, najpierw piszesz zerowy argument (this), następnie kropkę ('.'), nazwę funkcji, otwarcie nawiasu ('('), argumenty oddzielone przecinkiem (',') i w końcu zamknięcie nawiasu (')'). Jednakże przy braku argumentów nawias nie jest konieczny.

source: Collections
pl: Kolekcje

source: One of the indispensable features of a programming language are the collections. Of course, Plezuro provides some sorts of it.
pl: Jedną z nieodzownych możliwości języka programowania są kolekcje. Oczywiście, Plezuro zapewnia niektóre z nich.

source: List
pl: Lista (List)

source: Set
pl: Zbiór (Set)

source: To create a set, you use dollar sign ('$') and brackets. This collections is like the mathematical set. Each value can be contained only once.
pl: Aby utworzyć zbiór, możesz użyć znaku dolara ('$') oraz nawiasów. Ta kolekcja zachowuje się jak zbiór matematyczny. Każda wartość może wystąpić co najwyżej jeden raz.

source: Dictionary
pl: Słownik (Dictionary)

source: Associative array
pl: Tablica asocjacyjna

source: It is like the associative array in PHP or object in Javascript. In the version of Plezuro compiled to Javascript the main appliance of this collection is to pass Javascript objects to methods from libraries. You write it with a percent sign ('%') and brackets.
pl: To jest jak tablica asocjacyjna w PHP czy też obiekt w Javascripcie. W wersji Plezuro kompilowanej do Javascripta główne zastosowanie tego typu kolekcji to przekazywanie obiektów do metod z bibliotek javascriptowych. Możesz to zapisać jako procent ``%`` z nawiasami.

source: Comments
pl: Komentarze

source: Conditions
pl: Instrukcje warunkowe

source: At first, you should write the condition (function that return a boolean value). Then write '.if' and in brackets and curlies write the expression that will be executed when this expression is true. It is just a method of the function type. Then you can use methods 'elif' and 'else' which are not required.
pl: Na początku powinieneś napisać warunek (funkcję zwracającą wartość boolowską). Następnie '.if' oraz w nawiasach i klamrach wyrażanie, które będzie wykonywane jeśli początkowy warunek jest prawdziwy. To po prostu metoda typu funkcja. Następnie możesz użyć metod 'elif' oraz 'else', które to nie są wymagane.

source: Exceptions
pl: Wyjątki

source: One of the powerful features of a programming language is the exception handling. It is also possible in Plezuro. However the syntax is a little bit different because in this language almost all is based on the methods (even conditionals and loops).
pl: Jedną z potężnych możliwości języka programowania jest przechwytywanie wyjątków. To jest możliwe również w Plezuro. Jednakże składnia jest nieco inna ponieważ w tym języku prawie wszystko jest oparte na metodach (nawet instrukcje warunkowe i pętle).

source: Functions
pl: Funkcje

source: To write a function, you use just the curlies ('{', '}'). Everything in a curly bracket is a function. It includes also conditions and loops. The zero argument is accessible via the keyword 'this' and the next ones 'first', 'second' and 'third'. You have also access to the array of the arguments using the keyword 'args'.
pl: Aby napisać funkcję, należy użyć klamer ('{', '}'). Każdy kod wewnątrz klamry jest funkcją. To dotyczy również instrukcji warunkowych i pętel Zerowy argument jest dostępny poprzez słowo kluczowe 'this' a następne 'first', 'second', 'third'. Jest również dostęp do tablicy wszystkich argumentów poprzez słowo kluczowe 'args'.

source: You can return a value with 'return' keyword. When in function execution no previous value has been returned, it returns the value of the last statement (like in Ruby).
pl: Można zwracać wartość przy użyciu słowa kluczowego 'return'. Kiedy w wykonaniu funkcji dotychczas nie zwrócono żadnej wartości, jest zwracana wartość ostatniego wyrażenie (tak jak w Ruby).

source: It is recommended to divide programming projects to multiple source files. You can do it with the 'import' method of the string type. It is also possible to pass same parameters to the imported script, it works in the same way like the function.
pl: Jest zalecane dzielenie projektów programistycznych na wiele plików źródłowych. Można to zrobić, wykorzystując metodę 'import' z typu String. Można również przekazywać parametry do importowanego skryptu, to działa w taki sposób jak w przypadku funkcji.

source: Basics
pl: Podstawy

source: Loops
pl: Pętle

source: Loops look like conditional expressions. You use a method of the function type.
pl: Pętle wyglądają podobnie jak wyrażenie warunkowe. Jest używana metoda z typu Function.

source: One of the loops provided in Plezuro is 'while'. At the beginning you write a function which returned value determines if the function being the first argument of the 'while' method is executed. After the first iteration the conditional function is executed again. Execution of the first argument function depends on the value from conditional function and so on.
pl: Jedną z pętli istniejących w Plezuro to 'while'. Na początku należy napisać funkcję (zerowy argument, od której zwróconej wartości zależy, czy funkcja będąca pierwszym argumentem zostanie wykonana. Po pierwszej iteracji funkcja warunkowa jest wykonywana kolejny raz. Późniejsze wykonywanie funkcji będącej pierwszym argumentem znów zależy od wartości zwróconej przez funkcję warunkową i tak dalej.

source: Another maybe simpler loop is 'do'. You write the conditional function. The execution of the loop depends on the value returned by this function. So it iterates as long as the function returns true.
pl: Inną, może prostszą pętlą jest 'do'. Na początku pisze się funkcję warunkową. Wykonanie pętli zależy od wartości zwróconej przez tę funkcję. Zatem iteracje przebiegają tak długo, dopóki funkcja zwraca wartość true.

source: Magick constants
pl: Magiczne stałe

source: Similar to PHP and Ruby, Plezuro has the magick constants. What is it and why to use it? It is something a little bit like a variable and a little bit like a constant. Its value depends on the place where it is used.
pl: Podobnie do PHP i Ruby, Plezuro posiada magiczne stałe. Co to jest i dlaczego to używać? To jest coś poniekąd jak zmienna a trochę jak stała. Wartość zależy od miejsca, gdzie to jest użyte.

source: So we have the following magick constants:
pl: Zatem mamy następujące magiczne stałe:

source: __pos__ - the horizontal position in a line (counting from 0, it is position where the keyword begins)
pl: __pos__ - poziome położenie w obrębie linii (licząc od 0, to pozycja gdzie słowo kluczowe zaczyna się)

source: __line__ - the line number in a source file (counting from 0)
pl: __line__ - numer linii w pliku źródłowym (licząc od 0)

source: __file__ - the name of the source file
pl: __file__ - nazwa pliku źródłowego

source: __dir__ - the real directory of the source file
pl: __dir__ - pełna nazwa folderu pliku źródłowego

source: Operators
pl: Operatory

source: An important issue in Plezuro is you cannot have any operator immediately (excluding whitespaces and comments) before bracket (')'), square bracket (']') and curly ('}') close. So after the last element of the list you cannot put the comma and after the last statement of the function you cannot put the semicolon. In such a case it would be a syntax error.
pl: Ważną sprawą w Plezuro jest to, że nie można mieć żadnego operatora bezpośrednio (nie licząc białych znaków i komentarzy) przed zamknięciem jakiegokolwiek nawiasu (``)``, ``]``, ``}``). Zatem po ostatnim elemencie listy nie można postawić przecinka a także po ostatnim wyrażeniu funkcji nie można postawić średnika. W takim przypadku doszłoby do błędu składniowego.

source: Complete list of the operators:
pl: Pełna lista operatorów:

source: single-argument operators (the operator at the left, the argument at the right)
pl: jednoargumentowe operatory (operator po lewej, argument po prawej)

source: single-argument operators (the operator at the right)
pl: jednoargumentowe operatory (operator po prawej stronie)

source: Random numbers
pl: Losowe liczby

source: In computing it is useful for many purposes to generate random numbers. For example, when you write a computer player to a game or in a web application to generate registration links, local or web addreses and so on.
pl: W programowaniu jest użyteczne w wielu przypadkach generowanie liczb losowych. Np. kiedy tworzysz gracza komputerowego w jakiejś grze czy generujesz linki rejestracyjne w aplikacji webowej i tak dalej.

source: In Plezuro it is quite easy. You do not have to invoke any function or method (however later it is compiled to a method invokation). Just write the keyword 'rand'.
pl: W Plezuro to bardzo proste. Nie musisz wywoływać żadnej funkcji czy metody (jednak później jest to kompilowane do kodu z wywołaniem metody). Po prostu wystarczy napisać słowo kluczowe `rand`.

source: Variables
pl: Zmienne

source: Probably the most basic feature of a programing language are the variables. What is it? The variable is a block of a program memory that you can change at the runtime. You can assign it to a symbol and it works like the mathematics. The only difference is a variable can change his value. For example ```$x = 2 + 5; $y = x * 2```.
pl: Prawdopodobnie najbardziej podstawową możliwością języka programowania są zmienne. Co to jest? Zmienna to blok pamięci, który możesz zmieniać w trakcie wykonywania programu. Możesz przypisać taki blok do symbolu, a następnie to działa jak wyrażenia matematyczne. Jedyna różnica jest taka, że zmienna może zmieniać swoją wartość. Np. ``$x = 2 + 5; $y = x * 2``.

source: Declaration
pl: Deklaracja

source: Before we can use any variable, we have to declare it. It is pretty simple, just write the name of the variable and the dollar sign ('$') immediately before it. In next occurrences of a variable, you should write it without the dollar sign.
pl: Zanim możemy używać jakąkolwiek zmienną, musimy najpierw ją zadeklarować. To bardzo prost, wystarczy napisać nazwę zmiennej, poprzedzając ją bezpośrednio znakiem dolara ``$``. Przy następnych wystąpieniach zmiennej należy jej nazwę pisać już bez dolara.

source: Scope
pl: Zasięg

source: What can be a variable?
pl: Czym możne być zmienna?

source: In Plezuro there is dynamic typing like in other dynamic languages such as Python, Ruby or Javascript. Also everything is a variable (including functions and modules). So a variable can change its type in the runtime. For example at the first it is a number, then a list and finally a function.
pl: W Plezuro występuje typowanie dynamiczne tak jak w innych dynamicznych językach takich jak Python, Ruby czy Javascript. Również wszystko jest zmienną (uwzględniając funkcje i moduły). Zatem zmienna może zmieniać swój typ w trakcie wykonywania programu. Np. na początku jest ona liczbą, następnie listą, a w końcu funkcją.

source: Tutorial
pl: Przewodnik

source: Constructor
pl: Konstruktor

source: However for readability of the source code, it is a good idea to use constructors. What is exactly the constructor? It is a method that is invoked immediately after the memory allocation for the object. It is very explicit in Objective C when you at first allocate the memory and later you initialize it (for most cases is in the same line).
pl: Aczkolwiek dla czytelności kodu źródłowego, dobrym pomysłem jest użycie konstruktorów. Czym jest dokładnie konstruktor? To metoda wywoływana bezpośrednio po zaalokowaniu pamięci dla obiektu. Jest to bardzo jawne w Objective C gdzie najpierw w kodzie jest alokowana pamięć, a następnie przebiega inicjalizacja (w większości przypadków jest to w tej samej linii).

source: In Plezuro the constructor is a method with the name 'init'. Such a method is called automatically after the object creation.
pl: W Plezuro konstruktor to metoda z nazwą 'init'. Taka metoda jest wywoływana automatycznie po stworzeniu obiektu.

source: Default constructor
pl: Konstruktor domyślny

source: However when you do not write any constructor, there exists a constructor that is invoked. It is called the default constructor. What does it exactly do? It invokes the constructors of all the parent modules. When a module does not have any explicit parents it inherits from the BasicModule so in such a situation the constructor of the BasicModule is called - it creates the fields of the object from the associative array which is passed as a first argument.
pl: Wszakże kiedy brakuje w kodzie konstruktora, istnieje pewien konstruktor który jest wywoływany. Zwany jest konstruktorem domyślnym. Co to dokładnie robi? Wywołuje on konstruktory wszystkich modułów macierzystych. Kiedy moduł nie ma żadnych jawnych rodziców, dziedziczy on po BasicModule, więc w takiej sytuacji jest wywoływany konstruktor BasicModule, który to tworzy pola obiektu z tablicy asocjacyjnej przekazanej jako pierwszy argument.

source: Dynamic module change
pl: Dynamiczna zmiana modułu

source: Method addition/change
pl: Dodanie/usuwanie metody

source: Except of creating a method during a module creation you can add dynamically new methods to a module later. We could say 'at the runtime' but this term is not suitable to the Plezuro because in this language everything is at the runtime. The new method is visible in the direct objects of this module (even created before the addition of a new method) as well in the objects of the child modules. You can achieve that using the method 'addMethod'.
pl: Poza tworzeniem metody w czasie powstawania modułu, można również dynamicznie dodawać nowe metody później. Można by powiedzieć 'w trakcje 'wykonywania programu' ale to określenie nie jest odpowiednie w przypadku Plezuro ponieważ w tymże języku wszystko dzieje się w trakcie wykonywania programu. Nowa metoda jest widoczna w bezpośrednich obiektach danego modułu (stworzonych nawet przed dodaniem nowej metody) jak również w obiektach modułów dziedziczących. Możesz zrealizować to, używając metodą 'addMethod'.

source: Method removing
pl: Usuwanie metody

source: It is even possible to remove a method. Nonetheless do not do it without any reason. To do it, use the method 'removeMethod'.
pl: Jest nawet możliwe usunąć metodę. Mimo wszystko nie rób tego bez powodu. Aby to zrobić, użyj metody 'removeMethod'.

source: Objective programming
pl: Programowanie obiektowe

source: Plezuro is an object-oriented language, there is multiple inheritance. It is more dynamic then Java and .NET because you can add, change and remove methods at the runtime.
pl: Plezuro jest językiem obiektowym, występuje tutaj wielokrotne dziedziczenie. Jest bardziej dynamiczny niż Java i .NET ponieważ możesz dodawać, zmieniać i usuwać metody w trakcie wykonywania programu.

source: Inheritance
pl: Dziedziczenie

source: How does it work? Is is pretty simple, when you invoke a method on an object, if there exists such a method directly in the module of this object, this method is called. Otherwise it is a method from one of the parents of the module (the order of finding a method is the same as the order of declaring the parents in the module. The algorithm of find a method is recursive. When no method is found, an exception is thrown. It is as you can see it. However in reality in the moment of a module creation all the methods are binded (direct ones and inherited ones), it is for the performance.
pl: Jak to działa? To bardzo proste, kiedy wywołujesz metodę, na obiekcie, kiedy istnieje taka metoda bezpośrednio w module danego obiektu, metoda ta jest wywołana. W przeciwnym razie jest to metoda z jednego z rodziców modułu (kolejność znajdowania metody jest taki sam jak kolejność zadeklarowanych rodziców przy tworzeniu modułu. Algorytm znajdowania metody jest rekurencyjny. Jeśli żadna metoda nie została znaleziona, jest wyrzucany wyjątek. W taki sposób możesz to zaobserwować. Natomiast w rzeczywistości w momencie stworzenia modułu wszystkie metody są wiązane (bezpośrednie i dziedziczone), tak jest ze względu na wydajność

source: What about the polymorphism? Plezuro like other dynamic languages has a duck typing. So you can invoke a method with a specific name from an object, not knowing the module of the object. On the other hand, you can use the multiple inheritance. You can create a module with a specific method and use objects of this module in other methods or functions.
pl: A co o na temat polimorfizmu? W Plezuro tak jak w innych dynamicznych językach występuje duck typing. Zatem można wywołać metoda z konkretną nazwą na danym obiekcie, nie znając modułu tego obiektu. Można także używać wielokrotnego dziedziczenia.

source: Calling a parent method
pl: Wywołanie metody rodzica

source: Modules
pl: Moduły

source: Modules are in the same time classes and namespaces. You can use a module to create an object, you can use in statically (like static fields and methods in Java) and you can assign other modules as static fields creating namespaces. Of course you can create multiple classes in the same source file, however it is recommended to write exactly one module in one file.
pl: Moduły są jednocześnie klasami i przestrzeniami nazw. Można użyć moduł do stworzenia obiektu, można go użyć w sposób statyczny (tak jak pola i metody statyczne w Javie) a także przypisać inne moduły jako pola statyczne, tworząc w ten sposób przestrzenie nazw. Oczywiście da się tworzyć wiele modułów w tym samym pliku źródłowym, wszakże zalecane jest pisać dokładnie jeden moduł w jednym pliku.

source: To create a module, you write 'Module.create' and you pass one argument to this method which is an associative array containing module name (field 'name'), module namespace (field 'namespace', the methods (field 'methods'), the parent modules (field 'parents') - the modules from which our module inherits the methods. There are also some other fields that you can pass.
pl: Aby stworzyć moduł, należy użyć składni ``Module.create`` i przekazać dokładnie jeden parametr do tej metody, który to jest tablicą asocjacyjną zawierającą nazwę modułu (pole 'name'), przestrzeń nazw modułu (pole 'namespace'), metody (pole 'methods'), a także rodziców (pole 'parents') - czyli moduły z których dziedziczymy. Istnieją również inne pola, które można przekazać.

source: You can create an object of a module using method 'new'.
pl: Aby stworzyć obiekt danego modułu, należy użyć metody 'new'.

source: Objects and methods
pl: Obiekty i metody

source: The main purpose of creating a module is you to use it as a template to creating objects and to call methods from the objects. When you call a method the object is accessible via the keyword 'this' and like in function invocation you can use the keywords 'first', 'second', 'third' and 'args'.
pl: Głównym celem tworzenie modułu jest jego użycie jak szablonu do budowania obiektów i wywoływania metod z tychże obiektów. Kiedy wywołujesz metodę, obiekt jest dostępny poprzez słowo kluczowe 'this' i tak jak w przypadku wywołania funkcji, można używać słów kluczowych ``first``, ``second``, ``third`` oraz ``args``.

source: Object fields
pl: Pola obiektów

source: To access an object field, you use the at sign ('@') and the field name. The fields can be created in the constructor when the object is created or later in any method.
pl: Aby uzyskać dostęp do pola obiektu z metody wywołanej na tym obiekcie, należy użyć znaku małpa ``@`` a bezpośrednio po nim podać nazwę pola. Pola mogą być tworzone w konstruktorze kiedy obiekt jest tworzony lub później w jakiejkolwiek metodzie.

source: Method from method call
pl: Wywołanie metody z innej metody

source: To call a method from another method, you write the 'this' keyword, the dot ('.') and and the method name. Like in calling methods from outer objects you can omit the bracket when it is no arguments.
pl: Aby wywołać metodę z innej metody, należy napisać słowo kluczowe ``this``, kropkę.

source: Be aware that when you have an inner function (ex. a loop), the keyword 'this' has a different meaning. It is the zero argument of the inner function. In the same way the object fields work.
pl: Pamiętaj, w przypadku funkcji wewnętrznej (np. pętle), słowo kluczowe ``this`` oznacza co innego. Wtedy jest to zerowy argument funkcji wewnętrznej. W ten sam sposób działają pola obiektu.

source: Similar to defining method of a module, you can define actions that will be done when an object interacts with a specific operator.
pl: Podobnie do definiowania modułu, można zdefiniować akcje, które zostaną wykonane kiedy na obiekt będzie działać odpowiedni operator.

source: Static fields and methods
pl: Pola i metody statyczne
